
'''
다중 주석

'''
#한줄주석석

#을 기준으로 뒤에 것을 주석처리한다. 

# ---> (ctrl +/)

# alt + 방향키 방향 움직인다.
#print (  "   *" )
#print( "  *** ")
#print(" ***** ") 
#print("******** ")

#변수
#name = "김치찌개 " #변수 선언과 동시에 값을 넣어주는 것
#변수 ="값"
name = "김치볶움" #변수
'''
name = "김치찌개"
name =" 김치볶음밥" 
'''
#변수이름은 의미 있어야 한다. 읽었을때 의미를 알수 있어야 한다.
#name = "김치찌개"
#print(name)
#name ="김치볶음밥" 
#print(name)
#차례대로 읽히기 때문에 변수 값이 달라져서 값도 달라진다.

'''
변수의 이름 규칙칙
1.숫자로 시작하면 ㄴㄴ
2.소문자 대문자 서로 다른 값
3.변수 띄어쓰기 ㄴㄴ
te st =10 안됨
te_st =10 됨

'''
#name ='hyoeun'
#age =23
#month ='may'
#height = 164
#year =2003
#print(name,age,year,month,height)
#상수는 대문자로 써주는 센스

PI =3.14 # 대문자로 이루어진 변수는 상수 취급 하지마ㅏㄴ 파이썬은 변수만 허용 변동가능능
PI = 6
#
#age =10 #숫자
#test ="족발 먹고 싶다다"#문자자

#문자,숫자의 타입을 스스로 판단한다.
#타입 체크 
print(type(PI))
print(type(name))