#산술 연산자

#1 덧셈

result =5 +3
print(result) #결과 8

result =3 + 2.5
print(result) #결과 5.5

#문자열 덧셈 가능 

#기준은 항상 왼쪽

#2 뺄셈




#3곱셈






#4 나눗셈 (중요요)
# 11/2 =5.5
'''
11/2 =5.5
몫이 5도 나머지 1 
'''

print(11/2) #일반 나눗셈셈  (실수 가능)
print(10/2)
print(type(10/2)) #나머지가 없는 정수라 할지라도 실수형으로 만든다 5.0  으로 
print(11//2) # 몫만 


a= -5
b=2 
print( a/b) #결과 -2.5
print( a//b) #결과 -3 왜 -->내림으로 생각해서서


#나머지 
print(10 % 3 ) #1 몫 3 나머지 1 즉 1출력



#제곱
#10*10*10
print(10**5)  #밑 ** 지수


a =(10*10) +10 *(20*20) #100+10*400
print(a)


print(10^2)

'''
and 연산산
ture and false = false
둘다 참이 아니면 0 
둘다 참이여야지 1

or 둘중에 하나만 이여도 가능

xor은 값이 반대 
'''